app/views/blogs/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 12]]
---

            <% if @blog.comments.present? %>