app/controllers/blogs_controller.rb

  def index
    @blog =Blog.all
---
SELECT "blogs".* FROM "blogs"

  def update
    @blog = Blog.find(params[:id])
    authorize! :update, @blog
    if @blog.update(blog_params)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "blogs" SET "updated_at" = ? WHERE "blogs"."id" = ?  [["updated_at", "2023-08-25 02:13:29.962721"], ["id", 12]]

  def destroy
    @blog = Blog.find(params[:id])
    authorize! :destroy, @blog
    if @blog.destroy
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 1]]

  def create
    @blog = current_user.blogs.build(blog_params)
    @blog.user_id = current_user.id # Assign the current user's ID
    if @blog.save
---
INSERT INTO "blogs" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "aass"], ["description", "asas"], ["created_at", "2023-08-25 05:23:26.793769"], ["updated_at", "2023-08-25 05:23:26.793769"], ["user_id", 5]]