app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 6]]
---
    def show
      puts("this is id-------->>>>>>>>>>>>_------>>>> --------#{params[:id]}")
      @comment =Comment.find(params[:id])
     if @comment.destroy